{
  "game_title": "被催眠的绿帽夫夫 - 纯gay版超长互动故事游戏",
  "description": "基于原作全71章完整融合，纯gay非双性版。玩家为绿帽奴顾慎行，男友韦志交从高冷校草恶堕成极致抖M公共肉便器。每个分支包含超详细场景、心理活动、粗口对话、感官玩法描写，以及5-8个选择推动恶堕进度。",
  "author": "原作者",
  "status": {
    "sao_lang_jian": "骚0，浪0，贱0",
    "body_outtrack": "0%",
    "psy_outtrack": "0%"
  },
  "branches": [
    {
      "branch_id": "start_home",
      "chapter": "第1章：回家目击老婆被肏 + 恶魔任务下达",
      "scene_detail": "傍晚时分，夕阳透过落地窗洒在客厅地板上，你拖着疲惫的身躯推开家门，空气中弥漫着浓烈的汗臭和精液气息，令人窒息。韦志交被一个黝黑壮汉压在床上，修长白腿被折到胸前，翘臀变形，粉嫩屁眼被粗黑鸡巴整根没入抽出，白沫飞溅。他俊秀脸蛋潮红扭曲，眼神涣散，浪叫啊啊啊肏到前列腺了……好爽……要尿了……。壮汉抱他小儿把尿姿势深插到底，韦志交鸡巴在贞操锁里硬到滴精，被肏尿甩了你满头昂贵西装。你喉结滚动，鸡巴瞬间硬到发痛，跪下喘息爽……老婆被肏得好骚……。韦志交看见你先羞耻哭叫老公救我……，转瞬被肏到翻白眼吐舌，内心深处某种被压抑的欲望开始苏醒：为什么老公看着我被肏这么兴奋……我明明不想……但身体却背叛了意志，屁眼好爽……难道我骨子里就是个贱货……壮汉嘲笑顾乌龟，看你老婆被老子肏成母狗！射完精走人。恶魔声音在脑海中响起，带着冰冷的戏谑：第一天任务：让这骚货伺候至少五个男人。不听话，就把你们物化成肉便器哦。韦志交蜷缩在你怀里颤抖，声音带着哭腔老公……我不想去……，但身体却不受控制地兴奋，屁眼淫水直流，鸡巴硬得滴精，仿佛在渴望着即将到来的堕落。",
      "choices": [
        {
          "id": "choice_1_1",
          "choice": "1. 哄他接受任务，开车送去工地找农民工（进入工地主线第2-9章）",
          "effect": "夜幕降临，你开着豪车驶向城郊，车灯划破黑暗，远处工地铁皮屋的轮廓在月光下若隐若现。韦志交缩在副驾驶座上，颤抖的双手紧紧抓着安全带，眼神空洞地望着窗外飞逝的街景。抵达工地，你牵着他走向那间充满汗臭与烟味的铁皮屋，脚步声在空旷的工地上回荡。韦志交内心挣扎着，我是校草……却要被农民工轮……羞耻感如潮水般涌来，但身体却兴奋到鸡巴滴精，仿佛在期待着即将到来的屈辱。你亲手牵项圈让他狗爬进铁皮屋，看着他颤抖的背影，心中涌起扭曲的快感。",
          "status_update": "骚4，浪3，贱4 | 身体12% 心理15%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_1_2",
          "choice": "2. 先让他回宿舍，被室友张猛发现偷闻臭袜（宿舍支线）",
          "effect": "深夜的校园笼罩在一片寂静中，路灯昏黄的光线洒在宿舍楼前的石板路上，树影在微风中轻轻摇曳。韦志交拖着沉重的脚步走向男生宿舍，每一步都像是踩在刀尖上，内心充满了恐惧与期待。推开宿舍门，一股浓烈的雄性气息扑面而来，空气中弥漫着汗臭和脚臭，张猛的臭袜随意扔在床边，散发着令人心跳加速的诱人气息。韦志交的视线不由自主地被那堆散发着雄性荷尔蒙的袜子吸引，他颤抖着伸出手，拿起一只袜子深深吸了一口气，那股混合着汗水和脚臭的味道让他浑身一颤，鸡巴在裤子里不自觉地硬起。就在他沉浸在这股羞耻的快感中时，张猛突然推门而入，看到他手中的袜子，眼中闪过一丝玩味的光芒。张猛一把将他按在床上，粗糙的手掌撕开他的裤子，淫笑道：原来校草也喜欢闻我的臭袜子？韦志交被张猛按在床上爆肏屁眼，掐脖子口爆淋尿，哭叫不要……却主动吞精。在张猛粗暴的侵犯中，他内心深处涌起巨大的羞耻感，但身体却背叛了意志，屁眼不自觉地迎合着每一次冲击，鸡巴硬得滴精。他发现自己竟然在享受这种被支配的快感，高傲的自尊在张猛的粗暴下逐渐崩塌，内心深处某个被压抑的角落被彻底唤醒。",
          "status_update": "骚3，浪4，贱3 | 身体10% 心理18%",
          "next_branch": "dorm_entry"
        },
        {
          "id": "choice_1_3",
          "choice": "3. 深夜公园暴露，被乞丐轮奸当肉便器（暴露支线）",
          "effect": "月光如水，洒在公园幽静的小径上，树影婆娑，偶尔传来几声虫鸣，空气中弥漫着泥土和露水的清新气息。韦志交赤裸着身体，在夜色中颤抖前行，每一步都像是走向深渊，夜风拂过他赤裸的肌肤，带来阵阵寒意。远处传来乞丐们的低语声，像是来自地狱的召唤，他们的脚步声在寂静的夜晚格外清晰。韦志交脱光自慰被乞丐围上轮奸灌精尿，粗糙的手指在他身体上游走，浓烈的体臭和精液味道让他作呕却又兴奋，心理羞耻到自杀边缘，身体却在屈辱中连连失禁高潮。在黑暗的公园里，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感，屁眼不自觉地收缩，鸡巴硬得发痛，仿佛灵魂正在被一点点吞噬，内心深处某个被压抑的欲望被彻底唤醒。",
          "status_update": "骚5，浪6，贱5 | 身体20% 心理25%",
          "next_branch": "park_entry"
        },
        {
          "id": "choice_1_4",
          "choice": "4. 你先跪下自扇耳光示范当狗",
          "effect": "卧室的灯光昏暗，空气中弥漫着精液和汗水的味道。你跪在地板上，开始自扇耳光，啪啪的声音在房间里回荡。韦志交站在一旁，看着你下贱的样子，眼神中充满了震惊和莫名的兴奋。你自扇耳光教他老婆学老公怎么伺候主人。韦志交看着你下贱的样子，高傲的自尊心开始碎裂，内心涌起莫名的兴奋，竟然兴奋到喷精。他意识到，原来连你都可以如此下贱，那他又有什么理由抗拒呢？",
          "status_update": "骚4，浪3，贱5 | 身体8% 心理20%",
          "next_branch": "self_humiliation_entry"
        },
        {
          "id": "choice_1_5",
          "choice": "5. 试图反抗恶魔，拒绝任务",
          "effect": "恶魔的声音在脑海中回荡，带着冰冷的威胁。你试图反抗，但恶魔的笑声穿透了你的意志。恶魔惩罚把韦志交物化成肉桌子，你看着他被路人轮用一天，屁眼灌满精尿。韦志交在物化的过程中，感受到自己的人格被一点点剥夺，只剩下肉体的快感，内心在绝望与快感中挣扎。",
          "status_update": "骚6，浪4，贱6 | 身体30% 心理25%",
          "next_branch": "punish_entry"
        },
        {
          "id": "choice_1_6",
          "choice": "6. 先去网吧被油腻网管轮（网吧支线）",
          "effect": "深夜的网吧，昏暗的灯光下，键盘敲击声和游戏音效交织在一起，空气中弥漫着浓烈的烟味、汗臭和泡面混合的气息。韦志交走进网吧，网管油腻的目光如狼似虎地扫过他的身体，嘴角露出一丝淫笑。网管用粗糙的手掌抓住韦志交的胳膊，将他按在电脑桌下，淫笑道：校草也来网吧找刺激？韦志交被网管按桌下轮流口爆吞精，粗糙的手指在他嘴里搅动，浓烈的精液味道让他作呕却又兴奋，哭着舔干净鸡巴。在网吧昏暗的灯光下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感，屁眼不自觉地收缩，鸡巴硬得发痛，仿佛灵魂正在被一点点吞噬，内心深处某个被压抑的欲望被彻底唤醒。",
          "status_update": "骚5，浪4，贱5 | 身体15% 心理20%",
          "next_branch": "netbar_entry"
        },
        {
          "id": "choice_1_7",
          "choice": "7. 直接带去健身房卖身当器械（跳到健身房篇第66章起）",
          "effect": "健身房的灯光明亮，各种器械整齐排列，空气中弥漫着汗水和荷尔蒙的味道。韦志交被你牵着走进健身房，黄教练迎面走来，眼中闪烁着淫邪的光芒。韦志交被黄教练牵项圈遛狗展示屁眼，心理我成公共狗了……屁眼空虚流水。",
          "status_update": "骚5，浪4，贱5 | 身体18% 心理22%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_1_8",
          "choice": "8. 让恶魔直接传送异世界提前终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。恶魔把你们扔异世界，韦志交立即被怪物轮奸，你掰穴协助，快速恶堕。",
          "status_update": "骚9，浪9，贱9 | 身体100% 心理100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "construction_entry",
      "chapter": "工地主线入口：铁皮屋初次轮奸（第2章完整）",
      "scene_detail": "铁皮屋内汗臭与烟味交织，令人窒息，七八个黝黑农民工围坐一圈，目光如狼似虎。昏暗的灯光下，他们的脸庞模糊不清，但那贪婪的眼神却清晰可见。老李露出黄牙，淫笑道：顾乌龟，把老婆裤子扒光，让我们看看这校草的鸡巴和屁眼！你跪下，颤抖着亲手扒光韦志交，掰开他翘臀展示粉嫩屁眼和硬滴精的鸡巴。韦志交跪爬着，脸红到脖子根，内心深处涌起巨大的羞耻感：我是高冷校草……现在却被农民工看屁眼……这种屈辱感如潮水般淹没了他，但身体却背叛了意志，鸡巴硬到滴精，屁眼痒得扭臀，仿佛在渴望着即将到来的侵犯。小刘惊呆道：操，这屁眼真粉！韦志交羞耻哭叫不要看……，身体却不受控制地主动撅高翘臀，内心在羞耻与期待中挣扎。",
      "choices": [
        {
          "id": "choice_2_1",
          "choice": "1. 自扇耳光报告鸡巴屁眼使用说明（第3章）",
          "effect": "铁皮屋内，农民工们围成一圈，目光如狼似虎。韦志交站在中央，羞耻得浑身发抖。老李淫笑道：来，自己扇耳光，报告你的鸡巴和屁眼！韦志交扇着俊脸，哭喊着报告：贱狗鸡巴粉嫩是因为没肏过人……屁眼被拔肛毛失禁过……每一巴掌都像是在扇碎他的高傲自尊，内心深处，他感受到自己的人格正在一点点崩塌，高傲彻底碎裂，只剩下肉体的快感。",
          "status_update": "骚6，浪5，贱6 | 身体22% 心理28%",
          "next_branch": "construction_slap"
        },
        {
          "id": "choice_2_2",
          "choice": "2. 小刘玩鸡巴前列腺+布料摩擦屁眼+重弹鸡巴头（第4-5章改gay版）",
          "effect": "小刘走上前，粗糙的手指在韦志交的鸡巴和屁眼上游走。韦志交浑身颤抖，但身体却背叛了意志，鸡巴硬得滴精。小刘粗手指插屁眼抠前列腺到喷精，老李重弹鸡巴头到失禁射尿翻白眼。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被虐鸡巴……这种被支配的感觉让他感到前所未有的充实。",
          "status_update": "骚8，浪7，贱8 | 身体38% 心理45%",
          "next_branch": "construction_anal_torture"
        },
        {
          "id": "choice_2_3",
          "choice": "3. 走绳磨屁眼鸡巴失禁（第6-7章改gay版）",
          "effect": "你用钢刷把麻绳刷出尖锐毛毛，农民工们把韦志交架在绳上。韦志交被架粗麻绳上，屁眼鸡巴磨烂惨叫射尿。在痛苦的快感中，他内心深处产生了一种扭曲的认同感：我就是被绳子肏的贱狗，这种想法让他感到莫名的安心。",
          "status_update": "骚9，浪8，贱9 | 身体50% 心理55%",
          "next_branch": "construction_rope"
        },
        {
          "id": "choice_2_4",
          "choice": "4. 马眼插头发肏膀胱高潮（第8-9章完整）",
          "effect": "小刘拿起剪刀，剪下韦志交的一缕头发。韦志交看着那缕头发被塞进自己的马眼，内心涌起巨大的恐惧和期待。小刘剪头发塞马眼插膀胱，韦志交高潮喷精失禁，内心深处，他感受到自己的人格正在被一点点剥离，只剩下肉体的快感，心理雌堕。",
          "status_update": "骚9，浪9，贱9 | 身体60% 心理70%",
          "next_branch": "construction_hair"
        },
        {
          "id": "choice_2_5",
          "choice": "5. 秃头工臭脚踩鸡巴屁眼喷精",
          "effect": "秃头工走上前，脱下满是汗臭的鞋子，露出脏兮兮的脚。韦志交看着那双臭脚，内心涌起巨大的羞耻感，但身体却兴奋得鸡巴滴精。脏脚趾刮鸡巴头踩屁眼到喷精翻白眼。在臭脚的踩踏下，韦志交感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感，仿佛灵魂正在被一点点吞噬。",
          "status_update": "骚8，浪8，贱8 | 身体48% 心理58%",
          "next_branch": "construction_foot"
        },
        {
          "id": "choice_2_6",
          "choice": "6. 工地轮奸后转健身房",
          "effect": "铁皮屋内，七八个黝黑农民工轮番上阵，韦志交被肏到屁眼合不上，精尿横流，空气中弥漫着浓烈的精液和汗臭混合的气息。老李用粗糙的手指捏住韦志交的下巴，淫笑道：顾乌龟，你这骚货老婆屁眼都被我们肏烂了，送去健身房让那些肌肉男也尝尝鲜吧。你抱起浑身瘫软的韦志交走出铁皮屋，夜风带着凉意拂过他布满精液和汗水的赤裸身体，让他不由自主地颤抖。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外飞逝的霓虹灯，内心在极度的羞耻与扭曲的期待中挣扎：从农民工的粗野到健身房的专业调教，我到底会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交合不上的屁眼和红肿的鸡巴，眼中闪过一丝兴奋的光芒，他熟练地牵起项圈，开始遛狗般展示这个新来的公共玩具。韦志交心理我成真正的公共狗了……屁眼空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺，只剩下肉体的欲望在燃烧。",
          "status_update": "骚8，浪7，贱8 | 身体55% 心理65%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_2_7",
          "choice": "7. 直接传送异世界加速恶堕",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸提前终章。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "骚9，浪9，贱9 | 身体100% 心理100%",
          "next_branch": "final_hetero"
        },
        {
          "id": "choice_2_8",
          "choice": "8. 你跪舔韦志交被肏出的精尿",
          "effect": "韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
          "status_update": "骚7，浪6，贱7 | 身体40% 心理50%",
          "next_branch": "construction_lick"
        }
      ]
    },
    {
      "branch_id": "construction_slap",
      "chapter": "工地：自扇耳光+掰臀展示（第3章超详细）",
      "scene_detail": "铁皮屋内，农民工们围成一圈，目光如狼似虎。韦志交双手抱头站立，下身赤裸，粉嫩鸡巴半硬晃荡。你按他弯腰撅臀掰开翘臀，露出粉嫩屁眼和被玩过的红肿痕迹。农民工点评鸡巴粉嫩一看没肏过人屁眼真紧耐肏。韦志交扇自己俊脸十下，啪啪啪响亮，哭喊着报告：婊子鸡巴粉是因为没肏过人……屁眼被街头混混拔肛毛时痛到失禁……每一巴掌都像是在扇碎他的高傲自尊，内心深处涌起巨大的绝望：我完了……我真的成贱货了……这种自我认知的崩塌让他感到前所未有的空虚，但鸡巴却完全硬起滴精，仿佛在嘲笑他的虚伪。你讲解他被拔肛毛失禁送医院的事，众人嘲笑绿帽，韦志交在羞耻中感受到一种扭曲的快感，仿佛在确认自己确实是个贱货。",
      "choices": [
        {
          "id": "choice_3_1",
          "choice": "1. 继续小刘玩鸡巴前列腺",
          "effect": "小刘走上前，粗糙的手指在韦志交的鸡巴和屁眼上游走。韦志交浑身颤抖，但身体却背叛了意志，鸡巴硬得滴精。粗手指抠前列腺到喷精失禁。在极致的快感中，韦志交感受到自己的人格正在一点点崩塌，只剩下肉体的快感。",
          "status_update": "骚8，浪7，贱8 | 身体45% 心理52%",
          "next_branch": "construction_anal_torture"
        },
        {
          "id": "choice_3_2",
          "choice": "2. 直接走绳磨屁眼鸡巴",
          "effect": "你用钢刷把麻绳刷出尖锐毛毛，农民工们把韦志交架在绳上。韦志交被架粗麻绳上，屁眼鸡巴磨烂惨叫射尿。磨到惨叫射尿。在痛苦的快感中，他内心深处产生了一种扭曲的认同感：我就是被绳子肏的贱狗。",
          "status_update": "骚9，浪8，贱9 | 身体55% 心理60%",
          "next_branch": "construction_rope"
        },
        {
          "id": "choice_3_3",
          "choice": "3. 马眼插头发",
          "effect": "小刘拿起剪刀，剪下韦志交的一缕头发。韦志交看着那缕头发被塞进自己的马眼，内心涌起巨大的恐惧和期待。头发插尿道到膀胱高潮。在极致的快感中，他感受到自己的人格正在被一点点剥离，只剩下肉体的快感。",
          "status_update": "骚9，浪9，贱9 | 身体65% 心理75%",
          "next_branch": "construction_hair"
        },
        {
          "id": "choice_3_4",
          "choice": "4. 秃头工臭脚踩",
          "effect": "秃头工走上前，脱下满是汗臭的鞋子，露出脏兮兮的脚。韦志交看着那双臭脚，内心涌起巨大的羞耻感，但身体却兴奋得鸡巴滴精。脏脚趾刮鸡巴头踩屁眼到喷精翻白眼。踩到喷精翻白眼。在臭脚的踩踏下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感。",
          "status_update": "骚8，浪8，贱8 | 身体52% 心理62%",
          "next_branch": "construction_foot"
        },
        {
          "id": "choice_3_5",
          "choice": "5. 你舔精尿",
          "effect": "韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
          "status_update": "骚7，浪6，贱7 | 身体42% 心理55%",
          "next_branch": "construction_lick"
        },
        {
          "id": "choice_3_6",
          "choice": "6. 转健身房",
          "effect": "铁皮屋内，韦志交被农民工们玩弄得浑身瘫软，屁眼红肿合不上，精液和汗水混合的液体顺着大腿内侧流下。小刘用沾满泥灰的手拍打韦志交的翘臀，淫笑道：这骚货屁眼都被我们玩得这么松了，送去健身房让那些专业教练好好调教调教。你抱起浑身无力的韦志交走出铁皮屋，夜风带着凉意拂过他布满精斑的赤裸身体，让他不由自主地蜷缩起来。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神迷离地望着窗外闪烁的街灯，内心在羞耻与扭曲的快感中挣扎：从农民工的粗暴到健身房的专业调教，我的身体会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交红肿的屁眼和精液横流的大腿，眼中闪过一丝兴奋，他熟练地牵起项圈，开始向其他会员展示这个新来的公共玩具。韦志交心理我彻底成了公共狗……屁眼空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺。",
          "status_update": "骚8，浪7，贱8 | 身体58% 心理68%",
          "next_branch": "gym_entry"
        }
      ]
    },
    {
      "branch_id": "final_hetero",
      "chapter": "终章：异世界彻底雌堕（全书大结局）",
      "scene_detail": "异世界黑暗丛林，月光透过树叶洒下斑驳的光影。韦志交被哥布林群按住轮奸屁眼，史莱姆灌肠胀肚，触手拳交屁眼到脱肛，巨魔废鸡巴做人彘改造，胶衣束缚野外暴露。你跪旁亲手掰开他合不上的屁眼让怪物更方便插。韦志交浑身精尿胶衣，鸡巴被废又长更敏感，舌头耷拉翻白眼浪叫老公……谢谢你让我成最下贱的公共肉便器……我爱被所有生物肏烂屁眼……心理彻底雌堕。你看着他被虐到神志不清，兴奋射裤子。恶魔大笑欲望收集完成，你们永远是我的性奴。",
      "choices": [],
      "end_game": true,
      "final_status": "骚9，浪9，贱9 | 身体100% 心理100% - 恶堕完成！恭喜获得彻底出轨的骚货肉便器"
    },
    {
      "branch_id": "construction_anal_torture",
      "chapter": "工地篇：鸡巴前列腺极致虐待（第4-5章改gay版超详细）",
      "scene_detail": "铁皮屋内，农民工们围成一圈，目光如狼似虎。韦志交弯腰撅臀，翘臀被你死死掰成大洞，粉嫩屁眼暴露在炙热目光下，鸡巴在贞操锁里硬到滴精。小刘粗糙黑手带着泥灰，先用四指并排划动屁眼内壁，刮得肠肉东倒西歪，韦志交腿抖如筛糠，呜咽着：呜呜……屁眼被摸烂了……。老李指挥道：玩他鸡巴！把这校草鸡巴玩肿！小刘用廉价衣摆粗暴摩擦鸡巴头和柱身，摩擦到龟头红肿发亮，韦志交惨叫：啊啊啊鸡巴着火了……饶了贱狗鸡巴吧……。接着小刘两指掐住鸡巴头拽拉，像拽掉一样用力，韦志交翻白眼吐舌：鸡巴要掉了……好爽……死了……。最后老李中指如子弹重击鸡巴头最敏感处，韦志交被弹到腿蹬直、鸡巴激射前列腺液和黄尿，瘫在地上抽搐喷精失禁，尿液喷了你一身，你兴奋舔掉。韦志交内心深处涌起巨大的绝望：我以前是高冷校草……现在鸡巴被农民工弹尿……我彻底成抖M贱货了……但身体却背叛了意志，感受到前所未有的快感：好爽……不想停……这种被支配的感觉让他感到扭曲的满足，仿佛这才是他真正的归宿。",
      "choices": [
        {
          "id": "choice_4_1",
          "choice": "1. 继续走绳磨屁眼鸡巴失禁（无缝连接第6-7章）",
          "effect": "你用钢刷把麻绳刷出尖锐毛毛，农民工们把韦志交架在绳上。韦志交被架粗麻绳上，屁眼鸡巴磨烂惨叫射尿。在痛苦的快感中，他内心深处产生了一种扭曲的认同感：我就是绳子老公的贱狗，这种想法让他感到莫名的安心。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_rope"
        },
        {
          "id": "choice_4_2",
          "choice": "2. 马眼插头发肏膀胱高潮（无缝连接第8-9章）",
          "effect": "小刘拿起剪刀，剪下韦志交的一缕头发。韦志交看着那缕头发被塞进自己的马眼，内心涌起巨大的恐惧和期待。头发插尿道到膀胱高潮喷精。在极致的快感中，他感受到自己的人格正在被一点点剥离，只剩下肉体的快感，心理雌堕：我爱被插尿道。",
          "status_update": "+骚1，浪1，贱1 | +身体12% 心理15%",
          "next_branch": "construction_hair"
        },
        {
          "id": "choice_4_3",
          "choice": "3. 秃头工臭脚踩鸡巴屁眼喷精",
          "effect": "秃头工走上前，脱下满是汗臭的鞋子，露出脏兮兮的脚。韦志交看着那双臭脚，内心涌起巨大的羞耻感，但身体却兴奋得鸡巴滴精。脏脚趾刮鸡巴头踩屁眼到翻白眼喷精。在臭脚的踩踏下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感。",
          "status_update": "+骚1，浪1，贱1 | +身体8% 心理10%",
          "next_branch": "construction_foot"
        },
        {
          "id": "choice_4_4",
          "choice": "4. 你跪舔地上的精尿（绿帽加深）",
          "effect": "韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
          "status_update": "+骚1，浪0，贱1 | +身体5% 心理12%",
          "next_branch": "construction_lick"
        },
        {
          "id": "choice_4_5",
          "choice": "5. 工地轮奸后转健身房（无缝进入健身房篇）",
          "effect": "铁皮屋内，农民工们轮番上阵，韦志交被肏到屁眼合不上，精尿横流，空气中弥漫着浓烈的雄性气息。老李用粗糙的手掌拍打韦志交的臀部，淫笑道：这骚货屁眼都被我们肏得这么松了，送去健身房让那些肌肉男也尝尝鲜吧。你开车载着虚弱的韦志交驶向健身房，车窗外的霓虹灯在他苍白的脸上投下斑驳的光影，仿佛在嘲笑他即将到来的命运。韦志交靠在座椅上，身体随着车辆的颠簸而微微颤抖，内心在极度的羞耻与扭曲的期待中挣扎：从农民工的粗野到健身房的专业调教，我的身体会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交合不上的屁眼和精液横流的大腿，眼中闪过一丝兴奋的光芒，他熟练地牵起项圈，开始向其他会员展示这个新来的公共玩具。韦志交心理我彻底成了公共狗……屁眼空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_4_6",
          "choice": "6. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "construction_rope",
      "chapter": "工地篇：走绳磨屁眼鸡巴地狱（第6-7章改gay版超详细）",
      "scene_detail": "铁皮屋内，你亲手用钢刷把麻绳刷出尖锐毛毛，韦志交被农民工架在绳上，腿被钳制大开，翘臀压下，粗糙绳子精准卡进屁眼缝和鸡巴根部。绳子前后搅动摩擦，尖锐纤维像钢丝刮嫩肉，韦志交惨叫：啊啊啊屁眼鸡巴要被锯烂了……着火了……饶命啊……身体剧烈挣扎却被死死固定，只能微弱踢腿。绳子磨到鸡巴头红肿脱皮，屁眼肠肉翻出，韦志交翻白眼吐舌失禁射尿，尿液顺绳子流一地。在极致的痛苦与快感中，他内心深处涌起巨大的绝望：我……我就是被绳子肏的贱狗……但身体却背叛了意志，感受到前所未有的快感：好爽……不要停……这种被支配的感觉让他感到扭曲的满足，仿佛这才是他真正的归宿。农民工嘲笑道：看这校草摇屁股摇得多骚！你兴奋地挺起鸡巴自慰。",
      "choices": [
        {
          "id": "choice_5_1",
          "choice": "1. 让他自己夹绳走圈高潮（第8章延伸）",
          "effect": "农民工们松开韦志交，让他自己夹着绳子走圈。韦志交颤抖着迈开脚步，绳子在屁眼和鸡巴间摩擦，带来极致的快感。他一边走一边高潮，精尿横流。在极致的快感中，他内心深处产生了一种扭曲的认同感：我就是绳子老公的贱狗，这种想法让他感到莫名的安心。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_rope_walk"
        },
        {
          "id": "choice_5_2",
          "choice": "2. 马眼插头发肏膀胱高潮",
          "effect": "小刘拿起剪刀，剪下韦志交的一缕头发。韦志交看着那缕头发被塞进自己的马眼，内心涌起巨大的恐惧和期待。头发插尿道到膀胱高潮喷精。在极致的快感中，他感受到自己的人格正在被一点点剥离，只剩下肉体的快感，心理雌堕：我爱被插尿道。",
          "status_update": "+骚1，浪1，贱1 | +身体12% 心理15%",
          "next_branch": "construction_hair"
        },
        {
          "id": "choice_5_3",
          "choice": "3. 秃头工臭脚踩鸡巴屁眼喷精",
          "effect": "秃头工走上前，脱下满是汗臭的鞋子，露出脏兮兮的脚。韦志交看着那双臭脚，内心涌起巨大的羞耻感，但身体却兴奋得鸡巴滴精。脏脚趾刮鸡巴头踩屁眼到翻白眼喷精。在臭脚的踩踏下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感。",
          "status_update": "+骚1，浪1，贱1 | +身体8% 心理10%",
          "next_branch": "construction_foot"
        },
        {
          "id": "choice_5_4",
          "choice": "4. 你跪舔地上的精尿（绿帽加深）",
          "effect": "韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
          "status_update": "+骚1，浪0，贱1 | +身体5% 心理12%",
          "next_branch": "construction_lick"
        },
        {
          "id": "choice_5_5",
          "choice": "5. 工地轮奸后转健身房",
          "effect": "铁皮屋内，韦志交被农民工们玩弄得浑身瘫软，屁眼红肿合不上，绳子的纤维还残留在他的皮肤上。农民工们淫笑道：这骚货屁眼都被绳子磨得这么嫩了，送去健身房让那些专业玩家好好享受吧。你抱起虚弱的韦志交走出铁皮屋，夜风带着凉意拂过他布满绳痕和精液的赤裸身体，让他不由自主地颤抖。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神迷离地望着窗外闪烁的霓虹灯，内心在羞耻与扭曲的快感中挣扎：从绳子的粗糙摩擦到健身房的专业调教，我的身体会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交红肿的屁眼和绳痕累累的身体，眼中闪过一丝兴奋，他熟练地牵起项圈，开始向其他会员展示这个新来的公共玩具。韦志交心理我彻底成了公共狗……屁眼空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_5_6",
          "choice": "6. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "construction_hair",
      "chapter": "工地篇：马眼插头发肏膀胱高潮（第8-9章完整）",
      "scene_detail": "铁皮屋内，小刘拿起剪刀，剪下韦志交的一缕头发。韦志交看着那缕头发被塞进自己的马眼，内心涌起巨大的恐惧和期待。头发插尿道到膀胱高潮喷精。在极致的快感中，他感受到自己的人格正在被一点点剥离，只剩下肉体的快感，心理雌堕：我爱被插尿道。",
      "choices": [
        {
          "id": "choice_6_1",
          "choice": "1. 秃头工臭脚踩鸡巴屁眼喷精",
          "effect": "秃头工走上前，脱下满是汗臭的鞋子，露出脏兮兮的脚。韦志交看着那双臭脚，内心涌起巨大的羞耻感，但身体却兴奋得鸡巴滴精。脏脚趾刮鸡巴头踩屁眼到翻白眼喷精。在臭脚的踩踏下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感。",
          "status_update": "+骚1，浪1，贱1 | +身体8% 心理10%",
          "next_branch": "construction_foot"
        },
        {
          "id": "choice_6_2",
          "choice": "2. 你跪舔地上的精尿（绿帽加深）",
          "effect": "韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
          "status_update": "+骚1，浪0，贱1 | +身体5% 心理12%",
          "next_branch": "construction_lick"
        },
        {
          "id": "choice_6_3",
          "choice": "3. 工地轮奸后转健身房",
          "effect": "铁皮屋内，韦志交被农民工们玩弄得浑身瘫软，屁眼红肿合不上，头发还残留在他的马眼中。小刘淫笑道：这骚货屁眼和马眼都被插得这么开了，送去健身房让那些专业玩家好好开发吧。你抱起虚弱的韦志交走出铁皮屋，夜风带着凉意拂过他布满精液和汗水的赤裸身体，让他不由自主地颤抖。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神迷离地望着窗外闪烁的霓虹灯，内心在羞耻与扭曲的快感中挣扎：从头发插马眼的极致快感到健身房的专业调教，我的身体会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交红肿的屁眼和马眼中残留的头发，眼中闪过一丝兴奋，他熟练地牵起项圈，开始向其他会员展示这个新来的公共玩具。韦志交心理我彻底成了公共狗……屁眼和马眼都空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_6_4",
          "choice": "4. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "construction_foot",
      "chapter": "工地篇：秃头工臭脚踩鸡巴屁眼喷精",
      "scene_detail": "铁皮屋内，秃头工走上前，脱下满是汗臭的鞋子，露出脏兮兮的脚。韦志交看着那双臭脚，内心涌起巨大的羞耻感，但身体却兴奋得鸡巴滴精。脏脚趾刮鸡巴头踩屁眼到翻白眼喷精。在臭脚的踩踏下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感。",
      "choices": [
        {
          "id": "choice_7_1",
          "choice": "1. 你跪舔地上的精尿（绿帽加深）",
          "effect": "韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
          "status_update": "+骚1，浪0，贱1 | +身体5% 心理12%",
          "next_branch": "construction_lick"
        },
        {
          "id": "choice_7_2",
          "choice": "2. 工地轮奸后转健身房",
          "effect": "铁皮屋内，韦志交被农民工们玩弄得浑身瘫软，屁眼红肿合不上，秃头工的脚臭味还残留在他的皮肤上。秃头工淫笑道：这骚货屁眼都被我的臭脚踩得这么敏感了，送去健身房让那些专业玩家好好享受吧。你抱起虚弱的韦志交走出铁皮屋，夜风带着凉意拂过他布满脚臭和精液的赤裸身体，让他不由自主地颤抖。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神迷离地望着窗外闪烁的霓虹灯，内心在羞耻与扭曲的快感中挣扎：从臭脚的踩踏到健身房的专业调教，我的身体会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交红肿的屁眼和残留的脚臭味，眼中闪过一丝兴奋，他熟练地牵起项圈，开始向其他会员展示这个新来的公共玩具。韦志交心理我彻底成了公共狗……屁眼空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_7_3",
          "choice": "3. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "construction_lick",
      "chapter": "工地篇：你跪舔韦志交被肏出的精尿",
      "scene_detail": "铁皮屋内，韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
      "choices": [
        {
          "id": "choice_8_1",
          "choice": "1. 工地轮奸后转健身房",
          "effect": "铁皮屋内，韦志交被农民工们玩弄得浑身瘫软，屁眼红肿合不上，精液和尿液的混合液体还在他的皮肤上流淌。老李淫笑道：这骚货屁眼都被我们玩得这么松了，送去健身房让那些肌肉男也尝尝鲜吧。你抱起虚弱的韦志交走出铁皮屋，夜风带着凉意拂过他布满精斑的赤裸身体，让他不由自主地颤抖。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神迷离地望着窗外闪烁的霓虹灯，内心在羞耻与扭曲的快感中挣扎：从舔精尿的极致羞耻到健身房的专业调教，我的身体会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交红肿的屁眼和精液横流的大腿，眼中闪过一丝兴奋，他熟练地牵起项圈，开始向其他会员展示这个新来的公共玩具。韦志交心理我彻底成了公共狗……屁眼空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_8_2",
          "choice": "2. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "construction_rope_walk",
      "chapter": "工地篇：让他自己夹绳走圈高潮（第8章延伸）",
      "scene_detail": "铁皮屋内，农民工们松开韦志交，让他自己夹着绳子走圈。韦志交颤抖着迈开脚步，绳子在屁眼和鸡巴间摩擦，带来极致的快感。他一边走一边高潮，精尿横流。在极致的快感中，他内心深处产生了一种扭曲的认同感：我就是绳子老公的贱狗，这种想法让他感到莫名的安心。",
      "choices": [
        {
          "id": "choice_9_1",
          "choice": "1. 马眼插头发肏膀胱高潮",
          "effect": "小刘拿起剪刀，剪下韦志交的一缕头发。韦志交看着那缕头发被塞进自己的马眼，内心涌起巨大的恐惧和期待。头发插尿道到膀胱高潮喷精。在极致的快感中，他感受到自己的人格正在被一点点剥离，只剩下肉体的快感，心理雌堕：我爱被插尿道。",
          "status_update": "+骚1，浪1，贱1 | +身体12% 心理15%",
          "next_branch": "construction_hair"
        },
        {
          "id": "choice_9_2",
          "choice": "2. 秃头工臭脚踩鸡巴屁眼喷精",
          "effect": "秃头工走上前，脱下满是汗臭的鞋子，露出脏兮兮的脚。韦志交看着那双臭脚，内心涌起巨大的羞耻感，但身体却兴奋得鸡巴滴精。脏脚趾刮鸡巴头踩屁眼到翻白眼喷精。在臭脚的踩踏下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感。",
          "status_update": "+骚1，浪1，贱1 | +身体8% 心理10%",
          "next_branch": "construction_foot"
        },
        {
          "id": "choice_9_3",
          "choice": "3. 你跪舔地上的精尿（绿帽加深）",
          "effect": "韦志交被肏得精尿横流，你跪在地上，舔舐着那些液体。韦志交看着你下贱的样子，内心涌起扭曲的快感。你舔地上的液体，韦志交看着更兴奋。看着你下贱的样子，他内心涌起扭曲的快感，仿佛在确认自己确实是个贱货。",
          "status_update": "+骚1，浪0，贱1 | +身体5% 心理12%",
          "next_branch": "construction_lick"
        },
        {
          "id": "choice_9_4",
          "choice": "4. 工地轮奸后转健身房",
          "effect": "铁皮屋内，韦志交被农民工们玩弄得浑身瘫软，屁眼红肿合不上，绳子的纤维还深深嵌在他的皮肤里。农民工们淫笑道：这骚货屁眼都被绳子夹得这么敏感了，送去健身房让那些专业玩家好好享受吧。你抱起虚弱的韦志交走出铁皮屋，夜风带着凉意拂过他布满绳痕和精液的赤裸身体，让他不由自主地颤抖。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神迷离地望着窗外闪烁的霓虹灯，内心在羞耻与扭曲的快感中挣扎：从自己夹绳走圈的极致羞耻到健身房的专业调教，我的身体会变成什么样子？抵达健身房，黄教练早已在门口等候，看到韦志交红肿的屁眼和绳痕累累的身体，眼中闪过一丝兴奋，他熟练地牵起项圈，开始向其他会员展示这个新来的公共玩具。韦志交心理我彻底成了公共狗……屁眼空虚地渴望着更多侵犯。从工地的粗野到健身房的精致调教，韦志交感受到自己的人格正在被彻底剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_9_5",
          "choice": "5. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "dorm_entry",
      "chapter": "宿舍支线：被室友张猛发现偷闻臭袜",
      "scene_detail": "深夜的校园笼罩在一片寂静中，路灯昏黄的光线洒在宿舍楼前的石板路上，树影在微风中轻轻摇曳，仿佛在为即将上演的羞耻戏码伴奏。韦志交拖着沉重的脚步走向男生宿舍，每一步都像是踩在刀尖上，内心充满了恐惧与期待。他推开宿舍门，一股浓烈的雄性气息扑面而来，空气中弥漫着汗臭和脚臭，张猛的臭袜随意扔在床边，散发着令人心跳加速的诱人气息。韦志交的视线不由自主地被那堆散发着雄性荷尔蒙的袜子吸引，他颤抖着伸出手，拿起一只袜子深深吸了一口气，那股混合着汗水和脚臭的味道让他浑身一颤，鸡巴在裤子里不自觉地硬起。就在他沉浸在这股羞耻的快感中时，张猛突然推门而入，看到他手中的袜子，眼中闪过一丝玩味的光芒。张猛一把将他按在床上，粗糙的手掌撕开他的裤子，淫笑道：原来校草也喜欢闻我的臭袜子？韦志交被张猛按在床上爆肏屁眼，掐脖子口爆淋尿，哭叫不要……却主动吞精。在张猛粗暴的侵犯中，他内心深处涌起巨大的羞耻感，但身体却背叛了意志，屁眼不自觉地迎合着每一次冲击，鸡巴硬得滴精。他发现自己竟然在享受这种被支配的快感，高傲的自尊在张猛的粗暴下逐渐崩塌，内心深处某个被压抑的角落被彻底唤醒。",
      "choices": [
        {
          "id": "choice_10_1",
          "choice": "1. 继续被张猛调教",
          "effect": "张猛继续调教韦志交，让他彻底沦为自己的性奴。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被虐……这种被支配的感觉让他感到前所未有的充实。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "dorm_training"
        },
        {
          "id": "choice_10_2",
          "choice": "2. 转工地主线",
          "effect": "宿舍内，韦志交被张猛玩弄得浑身瘫软，屁眼红肿。张猛淫笑道：这骚货屁眼都被玩烂了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出宿舍，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从宿舍的粗暴到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_10_3",
          "choice": "3. 转健身房",
          "effect": "宿舍内，韦志交被张猛玩弄得浑身瘫软，屁眼红肿。张猛淫笑道：这骚货屁眼都被玩烂了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出宿舍，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交红肿的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从宿舍的粗暴到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_10_4",
          "choice": "4. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "dorm_training",
      "chapter": "宿舍支线：被张猛调教",
      "scene_detail": "宿舍内，张猛继续调教韦志交，让他彻底沦为自己的性奴。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被虐……这种被支配的感觉让他感到前所未有的充实。",
      "choices": [
        {
          "id": "choice_11_1",
          "choice": "1. 转工地主线",
          "effect": "宿舍内，韦志交被张猛玩弄得浑身瘫软，屁眼红肿。张猛淫笑道：这骚货屁眼都被我玩成这样了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出宿舍，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从宿舍的粗暴到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_11_2",
          "choice": "2. 转健身房",
          "effect": "宿舍内，韦志交被张猛玩弄得浑身瘫软，屁眼红肿。张猛淫笑道：这骚货屁眼都被我玩成这样了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出宿舍，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交红肿的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从宿舍的粗暴到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_11_3",
          "choice": "3. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "park_entry",
      "chapter": "暴露支线：深夜公园暴露，被乞丐轮奸当肉便器",
      "scene_detail": "月光如水，洒在公园幽静的小径上，树影婆娑，偶尔传来几声虫鸣。韦志交赤裸着身体，在夜色中颤抖前行，每一步都像是走向深渊。远处传来乞丐们的低语声，像是来自地狱的召唤。韦志交脱光自慰被乞丐围上轮奸灌精尿，心理羞耻到自杀边缘，身体连连失禁高潮。在黑暗的公园里，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感，仿佛灵魂正在被一点点吞噬。",
      "choices": [
        {
          "id": "choice_12_1",
          "choice": "1. 继续被乞丐轮奸",
          "effect": "乞丐们继续轮奸韦志交，让他彻底沦为公共肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被轮奸……这种被支配的感觉让他感到前所未有的充实。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "park_gangbang"
        },
        {
          "id": "choice_12_2",
          "choice": "2. 转工地主线",
          "effect": "公园内，韦志交被乞丐们玩弄得浑身瘫软，屁眼红肿合不上。乞丐们淫笑道：这骚货屁眼都被玩烂了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出公园，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交合不上的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从公园的肮脏到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_12_3",
          "choice": "3. 转健身房",
          "effect": "公园内，韦志交被乞丐们玩弄得浑身瘫软，屁眼红肿合不上。乞丐们淫笑道：这骚货屁眼都被玩烂了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出公园，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交合不上的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从公园的肮脏到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_12_4",
          "choice": "4. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "park_gangbang",
      "chapter": "暴露支线：继续被乞丐轮奸",
      "scene_detail": "公园内，乞丐们继续轮奸韦志交，让他彻底沦为公共肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被轮奸……这种被支配的感觉让他感到前所未有的充实。",
      "choices": [
        {
          "id": "choice_13_1",
          "choice": "1. 转工地主线",
          "effect": "公园内，韦志交被乞丐们玩弄得浑身瘫软，屁眼红肿合不上。乞丐们淫笑道：这骚货屁眼都被我们玩成这样了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出公园，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交合不上的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从公园的肮脏到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_13_2",
          "choice": "2. 转健身房",
          "effect": "公园内，韦志交被乞丐们玩弄得浑身瘫软，屁眼红肿合不上。乞丐们淫笑道：这骚货屁眼都被我们玩成这样了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出公园，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交合不上的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从公园的肮脏到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_13_3",
          "choice": "3. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "self_humiliation_entry",
      "chapter": "自虐支线：你先跪下自扇耳光示范当狗",
      "scene_detail": "卧室的灯光昏暗，空气中弥漫着精液和汗水的浓烈气息，窗帘紧闭，只有床头灯投下昏黄的光晕。你跪在地板上，开始自扇耳光，啪啪的声音在寂静的房间里回荡，每一巴掌都带着屈辱的快感。韦志交站在一旁，看着你下贱的样子，眼神中充满了震惊和莫名的兴奋，他的呼吸变得急促，鸡巴在裤子里不自觉地硬起。你自扇耳光教他老婆学老公怎么伺候主人，粗糙的手掌拍打脸颊的声音刺激着韦志交的神经。韦志交看着你下贱的样子，高傲的自尊心开始碎裂，内心涌起莫名的兴奋，竟然兴奋到喷精，精液顺着大腿内侧流下。他意识到，原来连你都可以如此下贱，那他又有什么理由抗拒呢？内心深处某个被压抑的欲望被彻底唤醒，他渴望被支配，渴望被羞辱，渴望成为真正的贱货。",
      "choices": [
        {
          "id": "choice_14_1",
          "choice": "1. 让韦志交自扇耳光",
          "effect": "韦志交开始自扇耳光，啪啪的声音在房间里回荡。每一巴掌都像是在扇碎他的高傲自尊，内心深处，他感受到自己的人格正在一点点崩塌，只剩下肉体的快感。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "self_humiliation_slap"
        },
        {
          "id": "choice_14_2",
          "choice": "2. 转工地主线",
          "effect": "卧室里，韦志交被自虐玩弄得浑身瘫软，屁眼红肿。你淫笑道：这骚货屁眼都被玩烂了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出卧室，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从卧室的自虐到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_14_3",
          "choice": "3. 转健身房",
          "effect": "卧室里，韦志交被自虐玩弄得浑身瘫软，屁眼红肿。你淫笑道：这骚货屁眼都被玩烂了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出卧室，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交红肿的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从卧室的自虐到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_14_4",
          "choice": "4. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "self_humiliation_slap",
      "chapter": "自虐支线：让韦志交自扇耳光",
      "scene_detail": "卧室的灯光昏暗，空气中弥漫着精液和汗水的味道。韦志交开始自扇耳光，啪啪的声音在房间里回荡。每一巴掌都像是在扇碎他的高傲自尊，内心深处，他感受到自己的人格正在一点点崩塌，只剩下肉体的快感。",
      "choices": [
        {
          "id": "choice_15_1",
          "choice": "1. 转工地主线",
          "effect": "卧室里，韦志交被自虐玩弄得浑身瘫软，屁眼红肿。你淫笑道：这骚货屁眼都被我玩成这样了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出卧室，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从卧室的自虐到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_15_2",
          "choice": "2. 转健身房",
          "effect": "卧室里，韦志交被自虐玩弄得浑身瘫软，屁眼红肿。你淫笑道：这骚货屁眼都被我玩成这样了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出卧室，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交红肿的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从卧室的自虐到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_15_3",
          "choice": "3. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "punish_entry",
      "chapter": "惩罚支线：试图反抗恶魔，拒绝任务",
      "scene_detail": "恶魔的声音在脑海中回荡，带着冰冷的威胁。你试图反抗，但恶魔的笑声穿透了你的意志。恶魔惩罚把韦志交物化成肉桌子，你看着他被路人轮用一天，屁眼灌满精尿。韦志交在物化的过程中，感受到自己的人格被一点点剥夺，只剩下肉体的快感，内心在绝望与快感中挣扎。",
      "choices": [
        {
          "id": "choice_16_1",
          "choice": "1. 继续接受惩罚",
          "effect": "恶魔继续惩罚韦志交，让他彻底沦为肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被惩罚……这种被支配的感觉让他感到前所未有的充实。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "punish_continue"
        },
        {
          "id": "choice_16_2",
          "choice": "2. 转工地主线",
          "effect": "惩罚结束后，韦志交被路人玩弄得浑身瘫软，屁眼红肿合不上。恶魔淫笑道：这骚货屁眼都被玩烂了，送去工地让农民工肏吧。你抱起虚弱的韦志交离开，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交合不上的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从惩罚的屈辱到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_16_3",
          "choice": "3. 转健身房",
          "effect": "惩罚结束后，韦志交被路人玩弄得浑身瘫软，屁眼红肿合不上。恶魔淫笑道：这骚货屁眼都被玩烂了，送去健身房让更多人肏吧。你抱起虚弱的韦志交离开，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交合不上的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从惩罚的屈辱到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_16_4",
          "choice": "4. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "punish_continue",
      "chapter": "惩罚支线：继续接受惩罚",
      "scene_detail": "恶魔继续惩罚韦志交，让他彻底沦为肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被惩罚……这种被支配的感觉让他感到前所未有的充实。",
      "choices": [
        {
          "id": "choice_17_1",
          "choice": "1. 转工地主线",
          "effect": "惩罚结束后，韦志交被路人玩弄得浑身瘫软，屁眼红肿合不上。恶魔淫笑道：这骚货屁眼都被我玩成这样了，送去工地让农民工肏吧。你抱起虚弱的韦志交离开，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交合不上的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从惩罚的屈辱到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_17_2",
          "choice": "2. 转健身房",
          "effect": "惩罚结束后，韦志交被路人玩弄得浑身瘫软，屁眼红肿合不上。恶魔淫笑道：这骚货屁眼都被我玩成这样了，送去健身房让更多人肏吧。你抱起虚弱的韦志交离开，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交合不上的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从惩罚的屈辱到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_17_3",
          "choice": "3. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "netbar_entry",
      "chapter": "网吧支线：先去网吧被油腻网管轮",
      "scene_detail": "深夜的网吧，昏暗的灯光下，键盘敲击声和游戏音效交织在一起。韦志交走进网吧，空气中弥漫着烟味和汗臭。网管油腻的目光扫过他的身体，嘴角露出一丝淫笑。韦志交被网管按桌下轮流口爆吞精，哭着舔干净鸡巴。在网吧昏暗的灯光下，他感受到前所未有的羞辱，但身体却在屈辱中达到了极致的快感，仿佛灵魂正在被一点点吞噬。",
      "choices": [
        {
          "id": "choice_18_1",
          "choice": "1. 继续被网管调教",
          "effect": "网管继续调教韦志交，让他彻底沦为公共肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被调教……这种被支配的感觉让他感到前所未有的充实。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "netbar_training"
        },
        {
          "id": "choice_18_2",
          "choice": "2. 转工地主线",
          "effect": "网吧内，韦志交被网管玩弄得浑身瘫软，屁眼红肿。网管淫笑道：这骚货屁眼都被玩烂了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出网吧，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从网吧的肮脏到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_18_3",
          "choice": "3. 转健身房",
          "effect": "网吧内，韦志交被网管玩弄得浑身瘫软，屁眼红肿。网管淫笑道：这骚货屁眼都被玩烂了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出网吧，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交红肿的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从网吧的肮脏到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_18_4",
          "choice": "4. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "netbar_training",
      "chapter": "网吧支线：继续被网管调教",
      "scene_detail": "网吧内，网管继续调教韦志交，让他彻底沦为公共肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被调教……这种被支配的感觉让他感到前所未有的充实。",
      "choices": [
        {
          "id": "choice_19_1",
          "choice": "1. 转工地主线",
          "effect": "网吧内，韦志交被网管玩弄得浑身瘫软，屁眼红肿。网管淫笑道：这骚货屁眼都被我玩成这样了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出网吧，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从网吧的肮脏到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_19_2",
          "choice": "2. 转健身房",
          "effect": "网吧内，韦志交被网管玩弄得浑身瘫软，屁眼红肿。网管淫笑道：这骚货屁眼都被我玩成这样了，送去健身房让更多人肏吧。你抱起虚弱的韦志交走出网吧，夜风拂过他赤裸的身体，带来一丝凉意。开车前往健身房的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达健身房，黄教练看到韦志交红肿的屁眼，眼中闪过一丝兴奋，牵起项圈开始遛狗展示。韦志交心理我成公共狗了……屁眼空虚流水。从网吧的肮脏到健身房的调教，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_entry"
        },
        {
          "id": "choice_19_3",
          "choice": "3. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "gym_entry",
      "chapter": "健身房篇：直接带去健身房卖身当器械（第66章起）",
      "scene_detail": "健身房的灯光明亮，各种器械整齐排列，空气中弥漫着汗水和荷尔蒙的味道。韦志交被你牵着走进健身房，黄教练迎面走来，眼中闪烁着淫邪的光芒。韦志交被黄教练牵项圈遛狗展示屁眼，心理我成公共狗了……屁眼空虚流水。",
      "choices": [
        {
          "id": "choice_20_1",
          "choice": "1. 继续被黄教练调教",
          "effect": "黄教练继续调教韦志交，让他彻底沦为公共肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被调教……这种被支配的感觉让他感到前所未有的充实。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "gym_training"
        },
        {
          "id": "choice_20_2",
          "choice": "2. 转工地主线",
          "effect": "健身房内，韦志交被黄教练玩弄得浑身瘫软，屁眼红肿。黄教练淫笑道：这骚货屁眼都被玩烂了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出健身房，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从健身房的调教到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_20_3",
          "choice": "3. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    },
    {
      "branch_id": "gym_training",
      "chapter": "健身房篇：继续被黄教练调教",
      "scene_detail": "健身房内，黄教练继续调教韦志交，让他彻底沦为公共肉便器。韦志交在极致的快感中，内心涌起扭曲的满足感：太爽了……我爱被调教……这种被支配的感觉让他感到前所未有的充实。",
      "choices": [
        {
          "id": "choice_21_1",
          "choice": "1. 转工地主线",
          "effect": "健身房内，韦志交被黄教练玩弄得浑身瘫软，屁眼红肿。黄教练淫笑道：这骚货屁眼都被我玩成这样了，送去工地让农民工肏吧。你抱起虚弱的韦志交走出健身房，夜风拂过他赤裸的身体，带来一丝凉意。开车前往工地的途中，韦志交靠在副驾驶座上，眼神空洞地望着窗外，内心在羞耻与期待中挣扎。抵达工地，农民工们早已等候多时，看到韦志交红肿的屁眼，眼中闪过一丝兴奋。韦志交被农民工们轮番上阵，心理我成公共狗了……屁眼空虚流水。从健身房的调教到工地的粗野，韦志交感受到自己的人格正在被一步步剥夺。",
          "status_update": "+骚1，浪1，贱1 | +身体10% 心理10%",
          "next_branch": "construction_entry"
        },
        {
          "id": "choice_21_2",
          "choice": "2. 直接传送异世界加速终章",
          "effect": "恶魔的声音在脑海中响起，带着冰冷的戏谑。一道光芒闪过，你们被传送到了异世界。怪物轮奸快速恶堕。在异世界的轮奸中，韦志交感受到自己的人格正在被彻底剥离，只剩下肉体的快感，心理彻底崩溃。",
          "status_update": "直接100%/100%",
          "next_branch": "final_hetero"
        }
      ]
    }
  ]
}